tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "ubuntu/microk8s"
brew "jpeg-xl"
brew "aom"
brew "asdf"
brew "chezmoi"
brew "coreutils"
brew "curl", link: true
brew "duckdb"
brew "ffmpeg"
brew "git"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "htop"
brew "k3d"
brew "openjpeg"
brew "libmicrohttpd"
brew "make"
brew "mpv", link: false
brew "neovim"
brew "nmap"
brew "noti"
brew "ollama"
brew "openvpn"
brew "pipx", link: false
brew "pngpaste"
brew "python@3.11"
brew "rtk"
brew "terminal-notifier"
brew "tesseract"
brew "tmux"
brew "unzip"
brew "vim"
brew "wget"
brew "zsh"
cask "docker-desktop"
cask "multipass"
cask "qview"
cask "stolendata-mpv"
cask "wine-stable"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bbenoist.nix"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.vscode-mysql"
vscode "galkowskit.go-interface-annotations"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "ijs.emotionsnippets"
vscode "innoverio.vscode-dbt-power-user"
vscode "jonkwheeler.styled-components-snippets"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "njpwerner.autodocstring"
vscode "nrwl.angular-console"
vscode "openai.chatgpt"
vscode "peggyjs.peggy-language"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "samuelcolvin.jinjahtml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "tamuratak.vscode-lezer"
vscode "technosophos.vscode-helm"
vscode "twxs.cmake"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"
vscode "zhangciwu.swig-tpl"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
go "cmd/go"
go "cmd/gofmt"
cargo "bat"
cargo "du-dust"
cargo "exa"
cargo "fd-find"
cargo "ripgrep"
cargo "tealdeer"
cargo "tree-sitter-cli"
uv "terraflex"
